---
kind: property
id: P:Autodesk.Revit.DB.CameraInfo.UpOffset
source: html/927f8022-85ae-ce88-c2c5-b709930f0846.htm
---
# Autodesk.Revit.DB.CameraInfo.UpOffset Property

Distance that the target plane is offset in the direction of
 the Up direction. This offset shifts both top and bottom planes.

## Syntax (C#)
```csharp
public double UpOffset { get; }
```